In [2]:
from faker import Faker
import numpy as np
import pandas as pd
import datetime
from datetime import date
import random
import string
fake = Faker('es_AR')
fake_tea = Faker("en_US")

In [3]:
size = 800000

In [4]:
df = pd.DataFrame(
    data = {
        "id": list(range(size)),
        "first_name": [fake.first_name() for i in range(size)],
        "last_name": [fake.last_name() for i in range(size)],
        "date_of_birth":[fake.date_of_birth(minimum_age=23, maximum_age=57) for i in range(size)],
        "email":[''.join(random.choice(string.ascii_lowercase + string.digits) for _ in range(8)) + "@" + fake.free_email_domain()  for i in range(size)],
    }
)

In [5]:
df.dtypes

id                int64
first_name       object
last_name        object
date_of_birth    object
email            object
dtype: object

In [6]:
df["date_of_birth"] = df["date_of_birth"].astype("date32[pyarrow]")

In [7]:
children_number = []
for row in df.date_of_birth.items():
    value = row[1]
    no_child = 0
    if value.year < 1997:
        no_child = np.random.normal(1.89,1).__int__()
    children_number.append(no_child)

df["number_of_children"] = children_number

In [8]:
sex = []
for row in df.first_name.items():
    value = row[1]
    if value.split()[0][-1] == "a":
        sex.append("Female")
    else:
        sex.append("Male")

df["sex"] = sex

In [15]:
education = []
annual_income_usd = []
job =[fake_tea.job() for i in range(size)],

for row in df.first_name.items():
    rand = random.random()
    if rand < 0.24:
        education.append("Tertiary")
        annual_income_usd.append(int(str(random.randint(46,215))+"000"))

    elif rand >= 0.24 and rand < 0.9:
        education.append("Secondary")
        annual_income_usd.append(int(str(random.randint(28,108))+"000"))
    else:
        education.append("Primary")
        annual_income_usd.append(int(str(random.randint(17,56))+"000"))

df["education"] = education
df["annual_income_usd"] = annual_income_usd

In [16]:
df.sample(10)

,id,first_name,last_name,date_of_birth,email,number_of_children,sex,education,annual_income_usd
655315,655315,Simon,Morales,1974-01-28,ic2druo7@yahoo.com,3,Male,Primary,49000
719115,719115,Mateo Benjamin,Dominguez,1974-01-16,ca6zn9gk@yahoo.com,2,Male,Secondary,75000
58236,58236,Francesco,Suarez,1973-04-04,d85a9dyg@yahoo.com,3,Male,Secondary,57000
630201,630201,Martina,Sosa,1986-11-04,8ev7dz6c@hotmail.com,4,Female,Tertiary,184000
796357,796357,Josefina,Flores,1986-05-04,2snjioxz@yahoo.com,1,Female,Secondary,77000
30582,30582,Delfina,Farias,1972-11-20,y6fw3to1@hotmail.com,2,Female,Secondary,71000
152573,152573,Genaro,Moyano,1978-08-04,a63p9u4d@yahoo.com,2,Male,Secondary,53000
423036,423036,Juan Pablo,Gonzalez,1986-04-14,6rxkz5by@gmail.com,0,Male,Secondary,34000
381657,381657,Valentina,Martinez,1974-08-29,f31a7uer@hotmail.com,2,Female,Secondary,71000
200699,200699,Juan Sebastian,Villalba,1997-05-17,9px0z54n@yahoo.com,0,Male,Secondary,87000

In [17]:
df.to_csv("ar_clients.csv")